// Задача 15: Напишите программу, которая
// 1: принимает на вход цифру, обозначающую день недели
// 2: проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

Console.Write("Введите цифру дня недели: ");
int a = Convert.ToInt32(Console.ReadLine());

if (a > 0 && a < 8)
{
    if (a > 0 && a < 6)
    {
        Console.Write("Нет");
    }
    else
    {
        Console.Write("Да");
    }
}
else
{
    Console.Write("На этой планете всего 7 дней в неделе. Вот ты и попался!");
}